s = '''В разные эпохи и у разных народов число Пи имело разное значение.
Например, в Древнем Египте оно равнялось 3.1604 у индусов оно приобрело
значение 3.162 китайцы пользовались числом, равным 3.1459
Буквенное обозначение число Пи получило только в 1706 году – оно происходит
от начальных букв двух греческих слов, означающих окружность и периметр.
Буквой π число наделил математик Джонс, а прочно вошла в математику она
уже в 1737 году.'''
k=[]
summa=0
count=0
maximum=0
for i in range(len(s)):
    if s[i].isdigit():
        k.append(s[i])
        summa=summa+int(s[i])
        count=count+1
        if int(s[i])>maximum:
            maximum=int(s[i])

print(k)
print("Количество:",count)
print("Сумма:",summa)
print("Наибольший:",maximum)

